title: Gootloader JavaScript Exection
id: ad02aa21-ba67-4721-ad4c-4fb203c434ce
status: experimental
description: Detects the typical attack chain seen by Gootloader malware leading to execution of a malicious JavaScript file. The parent of cscript.exe is often wscript.exe
references:
    - https://thedfirreport.com/2024/02/26/seo-poisoning-to-domain-control-the-gootloader-saga-continues/
author: Chris Wagner
date: 2024/03/05
modified: 2024/03/05
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: 
detection:
    selection:
        Image|endswith: '\powershell.exe'
        ParentImage|endswith: '\cscript.exe'
        ParentCommandLine|contains: '.js'
    condition: selection
fields:
    - CommandLine
    - Image
    - ParentImage
    - ParentCommandLine
falsepositives:
    - Unknown
level: high